{
    "Games" : {
        "PC" : {
            "Top" : [
                {
                    "name": "The Outer Worlds",
                    "img": "https://upload.wikimedia.org/wikipedia/en/e/e7/The_Outer_Worlds_cover_art.png",
                    "producer" : "Eric DeMilt",
                    "developer" : "Obsidian Entertainment",
                    "director" : "Leonard Boyarsky Tim Cain",
                    "publisher" : "Private Division",
                    "gamePlay" : "The Outer Worlds is an action role-playing video game featuring a first-person perspective. In the early stages of the game, the player can create their own character and unlock a ship, which acts as the game's central hub space. Though the player cannot control their ship, it serves as a fast travel point to access different areas in the game and the player's inventory.[1] The player can encounter and recruit non-player characters as companions who have their own personal missions and stories. When accompanying the player, the companions act as an aid in combat. Each companion has its own individual skills and special attacks, and it can also develop its own skill specialization. When exploring, the player can bring up to two companions alongside them, while the rest stay on the ship. The player can make numerous dialogue decisions, which can influence the game's branching story. They can also respond to NPCs in various ways, such as acting heroically, maniacally, or moronically. During combat situations, the player can use various weapon types such as melee and firearms, which have three ammo types: light, heavy and energy. These weapons can be customized to add elemental damage.[3] The player can use stealth or social skills (persuasion) to avoid combat altogether. As the player progresses, they gain experience points, which the player and their companions can use to level up and unlock new skills. The player can develop their technical skills, which are further divided into three categories: Science, Medical, and Engineering. For instance, the player can use a shrink ray to shrink down an enemy. The player is able to invest points into these skills, which will unlock new perks that enhance combat efficiency. The player can also enter a 'Tactical Time Dilation' state, which slows down time and reveals opponents' health statistics, which grants the player tactical advantages. As the player leads their companions, they improve their companions' combat strength and resilience.[2] The player can also gain a 'flaw' that occurs when the player fails repeatedly in certain gameplay segments. Flaws debuff the player in some way, but also give additional perks and advantages."
                },
                {
                    "name": "Call Of Duty : Modern Warface",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e9/CallofDutyModernWarfare%282019%29.jpg/220px-CallofDutyModernWarfare%282019%29.jpg",
                    "producer" : "Activision",
                    "developer" : "Infinity Ward[a]",
                    "director" : "Unknown",
                    "publisher" : "Activision",
                    "gamePlay" : "Modern Warfare's single-player campaign focuses on realism and feature tactically-based moral choices whereupon the player is evaluated and assigned a score at the end of each level; players have to quickly ascertain whether NPCs are a threat or not, such as a civilian woman who is believed to be reaching for a gun, but then simply grabs her baby from a crib. This collateral damage score, referred to as a threat assessment, is based on how many civilians the player injures or kills and ranges from rank A to F. Rewards are introduced to those who score higher.[6] Character dialogue will differ depending on the choices the player makes in the game.[7] Tactical decisions are also included, such as the player using a sniper rifle in a large environment to approach objectives in a non-linear order, and choosing to shoot out lights in favor of using night-vision goggles during breaching and clearing.[6] The game's multiplayer has been revised to allow for more tactical gameplay, including a focus on map exploration, door breaching, and a 'Realism' mode that removes the HUD. The mini-map has been removed in favor of a compass-style marker, with visual cues to detect friendlies and opponents. Multiplayer also features the return of Killstreaks (rewards based on kills), with more recent Call of Duty titles having used Scorestreaks (rewards based on score) instead. The online modes allow for a larger range of players within a map than previous installments, with a new mode called 'Ground Wa' featuring over 100 players,[8][9][10] while conversely another new mode, 'Gunfight', tasks two teams of two players against each other in small matches lasting forty seconds per round.[11] The game includes an extensive weapons customization system, presenting most guns with a range of up to 60 attachments to choose from (five of which can be equipped at any one time).[12] The introduction at the start of multiplayer matches has also been revamped; while in previous titles players would remain motionless on the map as a timer would countdown to zero, players will instead be transported into the battle zone as part of various animations.[9] Modern Warfare is the first game in the series since 2013's Call of Duty: Ghosts not to feature a Zombies mode,[13] instead featuring the cooperative 'Spec Ops' mode previously present in Call of Duty: Modern Warfare 2 and Call of Duty: Modern Warfare 3.[14] Spec Ops shares its narrative with both the campaign and multiplayer.[15] It includes a 'Survival' mode, which is a timed exclusive to the PlayStation 4 release until October 2020."
                },
                {
                    "name": "Apex Legends",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Apex_legends_cover.jpg/220px-Apex_legends_cover.jpg",
                    "producer" : "Drew McCoy Tina Sanchez",
                    "developer" : "Respawn Entertainment",
                    "director" : "Unknown",
                    "publisher" : "Electronic Arts",
                    "gamePlay" : "Apex Legends is a battle royale game in which up to 20 three-man squads land on an island before searching for weapons and supplies to then attempt to defeat all other players in combat. The final team alive wins the round. The game is set in the same sci-fi universe as Respawn Entertainment's Titanfall franchise.[1] Unlike other prominent battle-royale games, Apex Legends is also similar to 'hero shooters', in that it allows the player to choose from a selection of player characters before each round, each with a unique set of skills. The characters are known as 'legends' within the game.[2] The game focuses heavily on teamwork and includes a much praised system of nonverbal communication, known as 'Pinging', which allows players to use their game controller in order to communicate to their team things like directions, weapon locations, enemies and suggested strategies.[3] Using the 'Ping' command will create an icon (a so-called Ping) to appear at the location where the player is looking which is accompanied by an appropriate voice line from the player's in-game character. The Ping will be visible to the player as well as their teammates for a short duration. The Ping icon defaults to a 'Go' command, which suggests to the squad an area to explore. However, if the player is looking at something specific (such as a weapon or a piece of equipment) then the Ping icon will change contextually to highlight the presence and location of that object.[4] The Ping command system also has more advanced functionalities, such as tapping the Ping command twice in quick succession to highlight enemies, holding down the Ping command to bring up more detailed options, Pinging when you need ammunition or equipment, context-based Pings which are unique to characters within the game, and being able to respond to or cancel prior Pings.[4] Players who become knocked down in the course of a game can be revived by their teammates. Should a player be killed completely, they can still be resurrected if their team members collect a banner, which appears at the place where they died, and bring it to one of several beacons on the island.[2] The gameplay of Apex Legends is considered to be very fast-paced and action-packed, as intense firefights will break out frequently between rival teams and with the game allowing players a very high level of movement speed and freedom.[5]Apex Legends is a free-to-play game meaning that there is no initial purchase required in order to play.[1] The game instead includes a system of microtransactions and loot boxes which allow the player to spend both real money and in-game currency on cosmetic items, such as outfits for the game's 'legends' and new colors for weapons.[6] The developers of Apex Legends have outlined their roadmap for the game's first year of additional content, with a new game season planned for every three months. Each new season is intended to bring with it the release of a new playable character, new weapons and purchasable cosmetic items."
                }
            ],
            "New" : [

            ]
        },
        "MOBILE" : [
            {
                "id" : 1,
                "title" : "PUBG Mobile"
            },
            {
                "id" : 2,
                "title" : "Mobile Legend"
            }
        ],
        "BgImg" : "https://images.unsplash.com/photo-1492684223066-81342ee5ff30?ixlib=rb-1.2.1&auto=format&fit=crop&w=428&h=214&q=60"
    }
}