{
    "Games" : {
        "PC" : {
            "Top" : [
                {
                    "name": "The Outer Worlds",
                    "img": "https://upload.wikimedia.org/wikipedia/en/e/e7/The_Outer_Worlds_cover_art.png",
                    "producer" : "Eric DeMilt",
                    "developer" : "Obsidian Entertainment",
                    "director" : "Leonard Boyarsky Tim Cain",
                    "publisher" : "Private Division",
                    "gamePlay" : "The Outer Worlds is an action role-playing video game featuring a first-person perspective. In the early stages of the game, the player can create their own character and unlock a ship, which acts as the game's central hub space. Though the player cannot control their ship, it serves as a fast travel point to access different areas in the game and the player's inventory.[1] The player can encounter and recruit non-player characters as companions who have their own personal missions and stories. When accompanying the player, the companions act as an aid in combat. Each companion has its own individual skills and special attacks, and it can also develop its own skill specialization. When exploring, the player can bring up to two companions alongside them, while the rest stay on the ship. The player can make numerous dialogue decisions, which can influence the game's branching story. They can also respond to NPCs in various ways, such as acting heroically, maniacally, or moronically. During combat situations, the player can use various weapon types such as melee and firearms, which have three ammo types: light, heavy and energy. These weapons can be customized to add elemental damage.[3] The player can use stealth or social skills (persuasion) to avoid combat altogether. As the player progresses, they gain experience points, which the player and their companions can use to level up and unlock new skills. The player can develop their technical skills, which are further divided into three categories: Science, Medical, and Engineering. For instance, the player can use a shrink ray to shrink down an enemy. The player is able to invest points into these skills, which will unlock new perks that enhance combat efficiency. The player can also enter a 'Tactical Time Dilation' state, which slows down time and reveals opponents' health statistics, which grants the player tactical advantages. As the player leads their companions, they improve their companions' combat strength and resilience.[2] The player can also gain a 'flaw' that occurs when the player fails repeatedly in certain gameplay segments. Flaws debuff the player in some way, but also give additional perks and advantages."
                },
                {
                    "name": "Call Of Duty : Modern Warface",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e9/CallofDutyModernWarfare%282019%29.jpg/220px-CallofDutyModernWarfare%282019%29.jpg",
                    "producer" : "Activision",
                    "developer" : "Infinity Ward[a]",
                    "director" : "Unknown",
                    "publisher" : "Activision",
                    "gamePlay" : "Modern Warfare's single-player campaign focuses on realism and feature tactically-based moral choices whereupon the player is evaluated and assigned a score at the end of each level; players have to quickly ascertain whether NPCs are a threat or not, such as a civilian woman who is believed to be reaching for a gun, but then simply grabs her baby from a crib. This collateral damage score, referred to as a threat assessment, is based on how many civilians the player injures or kills and ranges from rank A to F. Rewards are introduced to those who score higher.[6] Character dialogue will differ depending on the choices the player makes in the game.[7] Tactical decisions are also included, such as the player using a sniper rifle in a large environment to approach objectives in a non-linear order, and choosing to shoot out lights in favor of using night-vision goggles during breaching and clearing.[6] The game's multiplayer has been revised to allow for more tactical gameplay, including a focus on map exploration, door breaching, and a 'Realism' mode that removes the HUD. The mini-map has been removed in favor of a compass-style marker, with visual cues to detect friendlies and opponents. Multiplayer also features the return of Killstreaks (rewards based on kills), with more recent Call of Duty titles having used Scorestreaks (rewards based on score) instead. The online modes allow for a larger range of players within a map than previous installments, with a new mode called 'Ground Wa' featuring over 100 players,[8][9][10] while conversely another new mode, 'Gunfight', tasks two teams of two players against each other in small matches lasting forty seconds per round.[11] The game includes an extensive weapons customization system, presenting most guns with a range of up to 60 attachments to choose from (five of which can be equipped at any one time).[12] The introduction at the start of multiplayer matches has also been revamped; while in previous titles players would remain motionless on the map as a timer would countdown to zero, players will instead be transported into the battle zone as part of various animations.[9] Modern Warfare is the first game in the series since 2013's Call of Duty: Ghosts not to feature a Zombies mode,[13] instead featuring the cooperative 'Spec Ops' mode previously present in Call of Duty: Modern Warfare 2 and Call of Duty: Modern Warfare 3.[14] Spec Ops shares its narrative with both the campaign and multiplayer.[15] It includes a 'Survival' mode, which is a timed exclusive to the PlayStation 4 release until October 2020."
                },
                {
                    "name": "Apex Legends",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Apex_legends_cover.jpg/220px-Apex_legends_cover.jpg",
                    "producer" : "Drew McCoy Tina Sanchez",
                    "developer" : "Respawn Entertainment",
                    "director" : "Unknown",
                    "publisher" : "Electronic Arts",
                    "gamePlay" : "Apex Legends is a battle royale game in which up to 20 three-man squads land on an island before searching for weapons and supplies to then attempt to defeat all other players in combat. The final team alive wins the round. The game is set in the same sci-fi universe as Respawn Entertainment's Titanfall franchise.[1] Unlike other prominent battle-royale games, Apex Legends is also similar to 'hero shooters', in that it allows the player to choose from a selection of player characters before each round, each with a unique set of skills. The characters are known as 'legends' within the game.[2] The game focuses heavily on teamwork and includes a much praised system of nonverbal communication, known as 'Pinging', which allows players to use their game controller in order to communicate to their team things like directions, weapon locations, enemies and suggested strategies.[3] Using the 'Ping' command will create an icon (a so-called Ping) to appear at the location where the player is looking which is accompanied by an appropriate voice line from the player's in-game character. The Ping will be visible to the player as well as their teammates for a short duration. The Ping icon defaults to a 'Go' command, which suggests to the squad an area to explore. However, if the player is looking at something specific (such as a weapon or a piece of equipment) then the Ping icon will change contextually to highlight the presence and location of that object.[4] The Ping command system also has more advanced functionalities, such as tapping the Ping command twice in quick succession to highlight enemies, holding down the Ping command to bring up more detailed options, Pinging when you need ammunition or equipment, context-based Pings which are unique to characters within the game, and being able to respond to or cancel prior Pings.[4] Players who become knocked down in the course of a game can be revived by their teammates. Should a player be killed completely, they can still be resurrected if their team members collect a banner, which appears at the place where they died, and bring it to one of several beacons on the island.[2] The gameplay of Apex Legends is considered to be very fast-paced and action-packed, as intense firefights will break out frequently between rival teams and with the game allowing players a very high level of movement speed and freedom.[5]Apex Legends is a free-to-play game meaning that there is no initial purchase required in order to play.[1] The game instead includes a system of microtransactions and loot boxes which allow the player to spend both real money and in-game currency on cosmetic items, such as outfits for the game's 'legends' and new colors for weapons.[6] The developers of Apex Legends have outlined their roadmap for the game's first year of additional content, with a new game season planned for every three months. Each new season is intended to bring with it the release of a new playable character, new weapons and purchasable cosmetic items."
                }
            ],
            "Best" : [
                {
                    "name": "Monster Hunter: World",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Monster_Hunter_World_cover_art.jpg/220px-Monster_Hunter_World_cover_art.jpg",
                    "producer" : "Hironobu Takeshita, Shingo Izumi, Kazunori Inoue",
                    "developer" : "Capcom",
                    "director" : "Yuya Tokuda",
                    "publisher" : "Capcom",
                    "gamePlay" : "Monster Hunter: World is an action role-playing game played from a third-person perspective. Similar to previous games in the series, the player takes the role of a player-created character who travels to the 'New World', an unpopulated land mass filled with monsters, to join the Research Commission that study the land from their central command base of Astera. The Research Commission tasks the Hunter to hunt down and either kill or capture large monsters that roam outside Astera to both protect the Commission and to study the monsters there.[1] The player's character does not have any intrinsic attributes, but instead these are determined by what equipment the character is equipped with. This includes a weapon, selected from the series' fourteen archetypes (such as long sword, bow, or hammer),[2] which then further defines the types of combat moves and abilities the player can use, and pieces of armor, which can lead to beneficial or detrimental combat skills if matched properly. While some basic equipment can be purchased using in-game money, most equipment is built from loot obtained by slaying or trapping monsters, rewards from completing quests, or items gathered while in the field. This creates a core loop of gameplay that has the player fight monsters they can beat to obtain the right loot to craft improved weapons and armor to allow them to face more powerful monsters and the potential for even better equipment. After taking a quest in Astera, or after choosing to simply go on an open-ended expedition, the player is taken to a base camp in one of six large regions that make up the New World. Each region is made up of numbered zones, but unlike previous Monster Hunter games, these zones are seamlessly connected, and there are no loading screens when moving between zones. The player must traverse zone to zone, though they can quick-travel to any of the base camps in that particular region when outside of combat. From camp, the player can acquire limited provisions, rest to restore their health, and new to World, have a meal that provides limited-time buffs to the player. The player sets out to track down monsters, which in World is aided with the use of Scout flies, which hover near tracks and other signs of large monsters, or highlight resources that the player can collect such as flora, ores, bones, and insects. Investigate the traces of the monster leads to improving the Scout flies' abilities for the quest, eventually enabling them to lead the player via their glowing flight path towards the monster they seek; further, investigating these help the player to gain research towards the monster that helps them gain insight on its strengths, weaknesses, and behavior.[3][4] Once a monster is located, the player can take several approaches to either slay or capture it using traps once sufficiently weakened, using a combination of their weapons and items they are carrying. As a monster is weakened, its tactics will often change, frequently becoming more aggressive, or fleeing to a lair to rest or find food to recover. The player has additional tools within World for combat. Each player has a Slinger, a tool that can be used to fire small projectiles like rocks at the monster to damage it or cause other debuffs, or can be used as a grappling hook to reach higher elevations or pull down objects onto a monster.[2] A new type of tool called a Mantle can be used for a limited amount of time; these cloak-like objects provide a buff to the player, such as acting like a ghillie suit to reduce the chances of monsters detecting the player. Furthermore, the player has opportunities to use the environment strategically against the monster, such as bursting a natural dam to flood out a monster, or leading a monster into another monster's den to cause them to fight each other.[2][5] The game includes a dynamic weather system and day-night cycle, which can affect the behavior of some monsters mid-quest.[2] In combat, the player must watch their health — if it falls to zero, they faint and are taken back to camp but then can set out again at a reduced reward; however, fainting three times will cause the quest to fail. Further, the player must watch their stamina, which is consumed for dodging and certain other attacks and actions; stamina will recover quickly but the player must not take other aggressive actions for this to happen, which can be tricky in the heat of battle. The player can carry various restorative items for health and stamina; unlike previous games where the player was forced to stand still to consume them, World allows the player to do so while walking, though the player must not be interrupted for a few moments to gain the full effects of the restorative item.[6] The player must also be aware of various debuffs that monsters can inflict on them, the sharpness of their weapon or the quantity of ammo for certain weapon types, and the limitations of items they can bring on a quest that restrict how much they can recover while in the field. If the player successfully completes the quest, they gain reward resources, often consisting of parts from that monster along with zenny, the in-game currency. The distribution of rewards from a quest are determined by rarity, so obtaining certain rare parts may require repeating a quest several times to get a desired part. Astera acts as a central hub where the player can buy and sell goods, manage their inventory, craft new equipment, and gain new quests.[3] A core facet of Monster Hunter games is the construction and upgrading of armor and weapons at a forge using the monster parts and resources the player has gained from combat. As the player defeats tougher monsters, they can make armor with more defensive value or particular elemental resistance, or can improve weapons to be more lethal and deal elemental or debuffing damage. Weapons and armor also carry various skills which have a number of different effects for the player; World introduces a new streamlined skill system compared to previous games, where each weapon or armor piece has one or more ranks in at least one skill, and the total effect of a skill on the player is determined by adding up all ranks of that skill from all equipped items the player carries. Additional services in Astera include a farm to grow quantities of flora while the player is out on quests, training areas to practice weapons, a gathering hub to take on special Arena challenges against one or more monsters, and a canteen which the player can order a meal from specific ingredients to provide buffs and special conditions while out on the field. World features a story mode offered through the quest system. Unlike previous games, where the story mode led the player through and to complete the 'Low Rank' quests, before opening the game to more difficult 'High Rank' quests without a story driver, World will have a narrative that continues into the 'High Rank' quests.[7] The game's complete story mode is estimated to take between 40 and 50 hours, according to director Yuya Tokuda.[8] Instead of quests that required the player to slay a number of smaller monsters or collect resources, World will offer these as Bounties that can be achieved alongside the main quests, or provided as Optional quests that generally lead to improving some facet of the resources in Astera.[9] A player can have up to six different Bounties active, and which provide rewards when they are completed.[10] The player can gain Investigation quests as well, which come from investigating the trail of monsters with Scout flies or by breaking off parts of monsters in combat. Each Investigation offers a quest that may have unique limitations or goals compared to main story quests, such as time limits or reduced fainting limits but also provide additional rewards; Investigations can only be attempted, successfully or not, a limited number of times before they are exhausted and removed. The game supports both single-player and up to four player cooperative mode while being online; there is no local offline multiplayer. The game's quest system is the same in both modes.[2] Players gather in multiplayer servers supporting up to sixteen players, during which they can post quests to invite others to join, or join other existing quests as long as they have progressed far enough in the game's storyline. If there are only one or two hunters on a quest, each brings with them a Palico (an anthropomorphic sentient cat species) to assist them in combat; these Palico can be equipped with weapons and armor crafted in the same manner as the hunter themselves. If there are less than four players in a party, a party member can launch a red SOS flare, which other players, while in their instance of Astera, can opt to join to help out, creating a drop-in/drop-out system.[2] The game also supports Squads, the equivalent of clans or guilds in typical massive multiplayer online games.[9] The game allows players in different release regions to work together; the game will use a pre-determined set of common greetings and commands that are translated to the various languages so that players can effectively communicate with each other.[2] However, players are limited to cooperating with those on the same platform, and will not feature cross-platform play.[3] Players also need to register with their console's service (PlayStation Network or Xbox Live) to use multiplayer features.[11] With an aim to reach a wider audience than past games, Monster Hunter: World also provides more information to players, such as a companion that will warn the player when they are running low on health, and more details on the advantages and disadvantages of weapons and armors against specific monsters.[4] In addition to quests shipped with the game, Capcom has offered downloadable content quests, similarly featured in the handheld versions. However, with the greater degree of connectivity offered by modern consoles/computers compared to handheld systems, Capcom has been able to offer several time-limited Event quests that players can easily jump in on through the new matchmaking system.[7][11][12] Through the event system, the game has included limited-time unique gameplay modes, such as a 16-person raid against a single monster, with players working in teams of four to help defeat the monster.[13] Capcom has also added new monsters to hunt through free downloadable content; the first such update, adding in the Deviljho monster from previous games was released alongside other quality-of-life updates in March 2018.[14][15][16] Capcom also expected to provide paid post-content material as well;[10] however, Capcom does not see World as a type of service, as they do not expect players to continue playing the game five to ten years after release.[17] The game will not include any type of microtransactions that influence gameplay; Tsujimoto said that as Monster Hunter is meant as a cooperative game, they did not want to create any type of 'friction' between players due to some having simply purchased better equipment with real-world funds compared to those that spent the time to work through challenges to acquire the equipment.[18] There is paid downloadable content available for the game, but these are limited to cosmetic items only, such as gestures, character customization options, and stickers used in communicating with other players."
                },
                {
                    "name": "Assassin's Creed Odyssey",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/ACOdysseyCoverArt.png/220px-ACOdysseyCoverArt.png",
                    "producer" : "Marc-Alexis Côté",
                    "developer" : "Ubisoft Quebec[a]",
                    "director" : "Jonathan Dumont Scott Phillips",
                    "publisher" : "Ubisoft",
                    "gamePlay" : "Assassin's Creed Odyssey places more emphasis on role-playing elements than previous games in the series. The game contains dialogue options, branching quests and multiple endings.[2] The player is able to choose between siblings Alexios and Kassandra as to whom they use as the main character.[3] The game features a notoriety system in which mercenaries chase after the player if they commit crimes like killing or stealing in the presence of others.[4] The player character is a Greek mercenary, and a descendant of the Spartan king Leonidas I. They inherit his broken spear, which is forged into a blade to become a weapon that grants the player special abilities in combat. The game uses a skill tree system that allows the player to unlock new abilities.[5] The three skill trees are 'hunter', which focuses on ranged attacks through the use of a bow & arrow, 'warrior', which focuses on weapons-based combat (swords, spears, axes etc.), and 'assassin', which focuses on stealth & silent take-downs. This replaces the system used in Origins, which granted the player a series of passive abilities. The hitbox combat system introduced in Origins returns and is expanded upon to grant the player access to different special skills when the ability bar fills up. These skills include calling a rain of arrows and a powerful kick to knock opponents off-balance,[4] and are similar to the 'Overpower' mechanic introduced in Origins that let the player use a powerful finishing move in combat. The game also features a gear system in which each piece of armor the player wears has different statistics and provides a range of advantages.[6] These can be equipped and upgraded individually. Assassin's Creed Odyssey also features naval combat again, with the player having access to Hellenistic-era warships to explore the Aegean Sea. The conflict between Athens and Sparta is represented through a 'War System' which enables players to take contracts from mercenaries and participate in different large-scale battles against hostile factions. The war system can change a faction's influence over a region.[6] The player can develop romantic relationships with non-playable characters of both genders, regardless of their own character's gender.[7][8] Creative director Jonathan Dumont commented that 'since the story is choice-driven, we never force players in romantic situations they might not be comfortable with (...) I think this allows everybody to build the relationships they want, which I feel respects everybody’s roleplay style and desires.' Players and critics appreciated this inclusion of queer romance options. However, many reacted negatively to a plot development in the Legacy of the First Blade DLC in which the player character has no choice but to enter into a relationship and have a child with a person of the opposite gender, considering that this invalidated their character's identity and the roleplaying aspects previously emphasized by Ubisoft.[9][10] Ubisoft responded that 'we strive to give players choice whenever possible in Odyssey and apologize to those surprised by the events in this episode'.[11][12] Ubisoft later stated that the forced romance would be removed with a future patch along with a modified cutscene.[13] However, this consisted of editing the cutscene slightly so that the player could tell their child they were only doing it for the blood-line - the child is still compulsory."
                },
                {
                    "name": "Hitman 2 (2018 video game)",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/8/88/Hitman_2_%282018%29_cover.jpg/220px-Hitman_2_%282018%29_cover.jpg",
                    "producer" : "Forest Swartout Large, Rasmus Nautrup Jensen, Karim Boussoufa, Kalvin Lyle, Jean Biam Tan",
                    "developer" : "IO Interactive",
                    "director" : "Christian Elverdam, Jacob Mikkelsen",
                    "publisher" : "Warner Bros. Interactive Entertainment",
                    "gamePlay" : "Hitman 2's gameplay is similar to that of the previous installment, being an action-adventure stealth-based game, as players control Agent 47, a contract assassin working for the International Contract Agency (ICA), in a third-person perspective, as he travels to various locations around the globe to eliminate high-profile criminal targets. The game features eight missions, which are set in distinct locations.[1][2] Summarily, the missions of the game take place (in order) on Hawke's Bay in New Zealand; at a racetrack in Miami; the fictional area of Santa Fortuna in Colombia; the slums of Mumbai; a fictional Vermont suburb; the fictional Isle of Sgàil somewhere in the North Atlantic; the fictional Milton-Fitzpatrick bank in New York City; and the fictional Haven Island resort in the Maldives. The game introduces concussive gadgets, which can be used to render an NPC unconscious, and reintroduces the briefcase, which allows the player to conceal and carry large weapons, such as sniper rifles, in public without arousing suspicion.[3] The game's announcement was accompanied by the release of a cooperative multiplayer mode titled Sniper Assassin, available immediately to those who pre-order Hitman 2. This mode is also bundled with all copies of Hitman 2 when the game releases.[4] In this mode, players are tasked with eliminating targets using a sniper rifle within a set time limit. In addition to Agent 47, players can play as Knight and Stone, both of whom have access to unique ammo types.[5] As with the game's predecessor, Hitman 2 features the time-limited 'Elusive Targets' missions. British actor Sean Bean portrays the first Elusive Target in the game."
                }
            ],
            "New" : [

            ]
        },
        "MOBILE" : {
            "Top" : [
                {
                    "name": "PUBG MOBILE LITE",
                    "img": "https://upload.wikimedia.org/wikipedia/en/e/e7/The_Outer_Worlds_cover_art.png",
                    "producer" : "Eric DeMilt",
                    "developer" : "Obsidian Entertainment",
                    "director" : "Leonard Boyarsky Tim Cain",
                    "publisher" : "Private Division",
                    "gamePlay" : "The Outer Worlds is an action role-playing video game featuring a first-person perspective. In the early stages of the game, the player can create their own character and unlock a ship, which acts as the game's central hub space. Though the player cannot control their ship, it serves as a fast travel point to access different areas in the game and the player's inventory.[1] The player can encounter and recruit non-player characters as companions who have their own personal missions and stories. When accompanying the player, the companions act as an aid in combat. Each companion has its own individual skills and special attacks, and it can also develop its own skill specialization. When exploring, the player can bring up to two companions alongside them, while the rest stay on the ship. The player can make numerous dialogue decisions, which can influence the game's branching story. They can also respond to NPCs in various ways, such as acting heroically, maniacally, or moronically. During combat situations, the player can use various weapon types such as melee and firearms, which have three ammo types: light, heavy and energy. These weapons can be customized to add elemental damage.[3] The player can use stealth or social skills (persuasion) to avoid combat altogether. As the player progresses, they gain experience points, which the player and their companions can use to level up and unlock new skills. The player can develop their technical skills, which are further divided into three categories: Science, Medical, and Engineering. For instance, the player can use a shrink ray to shrink down an enemy. The player is able to invest points into these skills, which will unlock new perks that enhance combat efficiency. The player can also enter a 'Tactical Time Dilation' state, which slows down time and reveals opponents' health statistics, which grants the player tactical advantages. As the player leads their companions, they improve their companions' combat strength and resilience.[2] The player can also gain a 'flaw' that occurs when the player fails repeatedly in certain gameplay segments. Flaws debuff the player in some way, but also give additional perks and advantages.."
                },
                {
                    "name": "Call Of Duty : Modern Warface",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e9/CallofDutyModernWarfare%282019%29.jpg/220px-CallofDutyModernWarfare%282019%29.jpg",
                    "producer" : "Activision",
                    "developer" : "Infinity Ward[a]",
                    "director" : "Unknown",
                    "publisher" : "Activision",
                    "gamePlay" : "Modern Warfare's single-player campaign focuses on realism and feature tactically-based moral choices whereupon the player is evaluated and assigned a score at the end of each level; players have to quickly ascertain whether NPCs are a threat or not, such as a civilian woman who is believed to be reaching for a gun, but then simply grabs her baby from a crib. This collateral damage score, referred to as a threat assessment, is based on how many civilians the player injures or kills and ranges from rank A to F. Rewards are introduced to those who score higher.[6] Character dialogue will differ depending on the choices the player makes in the game.[7] Tactical decisions are also included, such as the player using a sniper rifle in a large environment to approach objectives in a non-linear order, and choosing to shoot out lights in favor of using night-vision goggles during breaching and clearing.[6] The game's multiplayer has been revised to allow for more tactical gameplay, including a focus on map exploration, door breaching, and a 'Realism' mode that removes the HUD. The mini-map has been removed in favor of a compass-style marker, with visual cues to detect friendlies and opponents. Multiplayer also features the return of Killstreaks (rewards based on kills), with more recent Call of Duty titles having used Scorestreaks (rewards based on score) instead. The online modes allow for a larger range of players within a map than previous installments, with a new mode called 'Ground Wa' featuring over 100 players,[8][9][10] while conversely another new mode, 'Gunfight', tasks two teams of two players against each other in small matches lasting forty seconds per round.[11] The game includes an extensive weapons customization system, presenting most guns with a range of up to 60 attachments to choose from (five of which can be equipped at any one time).[12] The introduction at the start of multiplayer matches has also been revamped; while in previous titles players would remain motionless on the map as a timer would countdown to zero, players will instead be transported into the battle zone as part of various animations.[9] Modern Warfare is the first game in the series since 2013's Call of Duty: Ghosts not to feature a Zombies mode,[13] instead featuring the cooperative 'Spec Ops' mode previously present in Call of Duty: Modern Warfare 2 and Call of Duty: Modern Warfare 3.[14] Spec Ops shares its narrative with both the campaign and multiplayer.[15] It includes a 'Survival' mode, which is a timed exclusive to the PlayStation 4 release until October 2020."
                },
                {
                    "name": "Apex Legends",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Apex_legends_cover.jpg/220px-Apex_legends_cover.jpg",
                    "producer" : "Drew McCoy Tina Sanchez",
                    "developer" : "Respawn Entertainment",
                    "director" : "Unknown",
                    "publisher" : "Electronic Arts",
                    "gamePlay" : "Apex Legends is a battle royale game in which up to 20 three-man squads land on an island before searching for weapons and supplies to then attempt to defeat all other players in combat. The final team alive wins the round. The game is set in the same sci-fi universe as Respawn Entertainment's Titanfall franchise.[1] Unlike other prominent battle-royale games, Apex Legends is also similar to 'hero shooters', in that it allows the player to choose from a selection of player characters before each round, each with a unique set of skills. The characters are known as 'legends' within the game.[2] The game focuses heavily on teamwork and includes a much praised system of nonverbal communication, known as 'Pinging', which allows players to use their game controller in order to communicate to their team things like directions, weapon locations, enemies and suggested strategies.[3] Using the 'Ping' command will create an icon (a so-called Ping) to appear at the location where the player is looking which is accompanied by an appropriate voice line from the player's in-game character. The Ping will be visible to the player as well as their teammates for a short duration. The Ping icon defaults to a 'Go' command, which suggests to the squad an area to explore. However, if the player is looking at something specific (such as a weapon or a piece of equipment) then the Ping icon will change contextually to highlight the presence and location of that object.[4] The Ping command system also has more advanced functionalities, such as tapping the Ping command twice in quick succession to highlight enemies, holding down the Ping command to bring up more detailed options, Pinging when you need ammunition or equipment, context-based Pings which are unique to characters within the game, and being able to respond to or cancel prior Pings.[4] Players who become knocked down in the course of a game can be revived by their teammates. Should a player be killed completely, they can still be resurrected if their team members collect a banner, which appears at the place where they died, and bring it to one of several beacons on the island.[2] The gameplay of Apex Legends is considered to be very fast-paced and action-packed, as intense firefights will break out frequently between rival teams and with the game allowing players a very high level of movement speed and freedom.[5]Apex Legends is a free-to-play game meaning that there is no initial purchase required in order to play.[1] The game instead includes a system of microtransactions and loot boxes which allow the player to spend both real money and in-game currency on cosmetic items, such as outfits for the game's 'legends' and new colors for weapons.[6] The developers of Apex Legends have outlined their roadmap for the game's first year of additional content, with a new game season planned for every three months. Each new season is intended to bring with it the release of a new playable character, new weapons and purchasable cosmetic items."
                }
            ],
            "Best" : [
                {
                    "name": "Monster Hunter: World",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Monster_Hunter_World_cover_art.jpg/220px-Monster_Hunter_World_cover_art.jpg",
                    "producer" : "Hironobu Takeshita, Shingo Izumi, Kazunori Inoue",
                    "developer" : "Capcom",
                    "director" : "Yuya Tokuda",
                    "publisher" : "Capcom",
                    "gamePlay" : "Monster Hunter: World is an action role-playing game played from a third-person perspective. Similar to previous games in the series, the player takes the role of a player-created character who travels to the 'New World', an unpopulated land mass filled with monsters, to join the Research Commission that study the land from their central command base of Astera. The Research Commission tasks the Hunter to hunt down and either kill or capture large monsters that roam outside Astera to both protect the Commission and to study the monsters there.[1] The player's character does not have any intrinsic attributes, but instead these are determined by what equipment the character is equipped with. This includes a weapon, selected from the series' fourteen archetypes (such as long sword, bow, or hammer),[2] which then further defines the types of combat moves and abilities the player can use, and pieces of armor, which can lead to beneficial or detrimental combat skills if matched properly. While some basic equipment can be purchased using in-game money, most equipment is built from loot obtained by slaying or trapping monsters, rewards from completing quests, or items gathered while in the field. This creates a core loop of gameplay that has the player fight monsters they can beat to obtain the right loot to craft improved weapons and armor to allow them to face more powerful monsters and the potential for even better equipment. After taking a quest in Astera, or after choosing to simply go on an open-ended expedition, the player is taken to a base camp in one of six large regions that make up the New World. Each region is made up of numbered zones, but unlike previous Monster Hunter games, these zones are seamlessly connected, and there are no loading screens when moving between zones. The player must traverse zone to zone, though they can quick-travel to any of the base camps in that particular region when outside of combat. From camp, the player can acquire limited provisions, rest to restore their health, and new to World, have a meal that provides limited-time buffs to the player. The player sets out to track down monsters, which in World is aided with the use of Scout flies, which hover near tracks and other signs of large monsters, or highlight resources that the player can collect such as flora, ores, bones, and insects. Investigate the traces of the monster leads to improving the Scout flies' abilities for the quest, eventually enabling them to lead the player via their glowing flight path towards the monster they seek; further, investigating these help the player to gain research towards the monster that helps them gain insight on its strengths, weaknesses, and behavior.[3][4] Once a monster is located, the player can take several approaches to either slay or capture it using traps once sufficiently weakened, using a combination of their weapons and items they are carrying. As a monster is weakened, its tactics will often change, frequently becoming more aggressive, or fleeing to a lair to rest or find food to recover. The player has additional tools within World for combat. Each player has a Slinger, a tool that can be used to fire small projectiles like rocks at the monster to damage it or cause other debuffs, or can be used as a grappling hook to reach higher elevations or pull down objects onto a monster.[2] A new type of tool called a Mantle can be used for a limited amount of time; these cloak-like objects provide a buff to the player, such as acting like a ghillie suit to reduce the chances of monsters detecting the player. Furthermore, the player has opportunities to use the environment strategically against the monster, such as bursting a natural dam to flood out a monster, or leading a monster into another monster's den to cause them to fight each other.[2][5] The game includes a dynamic weather system and day-night cycle, which can affect the behavior of some monsters mid-quest.[2] In combat, the player must watch their health — if it falls to zero, they faint and are taken back to camp but then can set out again at a reduced reward; however, fainting three times will cause the quest to fail. Further, the player must watch their stamina, which is consumed for dodging and certain other attacks and actions; stamina will recover quickly but the player must not take other aggressive actions for this to happen, which can be tricky in the heat of battle. The player can carry various restorative items for health and stamina; unlike previous games where the player was forced to stand still to consume them, World allows the player to do so while walking, though the player must not be interrupted for a few moments to gain the full effects of the restorative item.[6] The player must also be aware of various debuffs that monsters can inflict on them, the sharpness of their weapon or the quantity of ammo for certain weapon types, and the limitations of items they can bring on a quest that restrict how much they can recover while in the field. If the player successfully completes the quest, they gain reward resources, often consisting of parts from that monster along with zenny, the in-game currency. The distribution of rewards from a quest are determined by rarity, so obtaining certain rare parts may require repeating a quest several times to get a desired part. Astera acts as a central hub where the player can buy and sell goods, manage their inventory, craft new equipment, and gain new quests.[3] A core facet of Monster Hunter games is the construction and upgrading of armor and weapons at a forge using the monster parts and resources the player has gained from combat. As the player defeats tougher monsters, they can make armor with more defensive value or particular elemental resistance, or can improve weapons to be more lethal and deal elemental or debuffing damage. Weapons and armor also carry various skills which have a number of different effects for the player; World introduces a new streamlined skill system compared to previous games, where each weapon or armor piece has one or more ranks in at least one skill, and the total effect of a skill on the player is determined by adding up all ranks of that skill from all equipped items the player carries. Additional services in Astera include a farm to grow quantities of flora while the player is out on quests, training areas to practice weapons, a gathering hub to take on special Arena challenges against one or more monsters, and a canteen which the player can order a meal from specific ingredients to provide buffs and special conditions while out on the field. World features a story mode offered through the quest system. Unlike previous games, where the story mode led the player through and to complete the 'Low Rank' quests, before opening the game to more difficult 'High Rank' quests without a story driver, World will have a narrative that continues into the 'High Rank' quests.[7] The game's complete story mode is estimated to take between 40 and 50 hours, according to director Yuya Tokuda.[8] Instead of quests that required the player to slay a number of smaller monsters or collect resources, World will offer these as Bounties that can be achieved alongside the main quests, or provided as Optional quests that generally lead to improving some facet of the resources in Astera.[9] A player can have up to six different Bounties active, and which provide rewards when they are completed.[10] The player can gain Investigation quests as well, which come from investigating the trail of monsters with Scout flies or by breaking off parts of monsters in combat. Each Investigation offers a quest that may have unique limitations or goals compared to main story quests, such as time limits or reduced fainting limits but also provide additional rewards; Investigations can only be attempted, successfully or not, a limited number of times before they are exhausted and removed. The game supports both single-player and up to four player cooperative mode while being online; there is no local offline multiplayer. The game's quest system is the same in both modes.[2] Players gather in multiplayer servers supporting up to sixteen players, during which they can post quests to invite others to join, or join other existing quests as long as they have progressed far enough in the game's storyline. If there are only one or two hunters on a quest, each brings with them a Palico (an anthropomorphic sentient cat species) to assist them in combat; these Palico can be equipped with weapons and armor crafted in the same manner as the hunter themselves. If there are less than four players in a party, a party member can launch a red SOS flare, which other players, while in their instance of Astera, can opt to join to help out, creating a drop-in/drop-out system.[2] The game also supports Squads, the equivalent of clans or guilds in typical massive multiplayer online games.[9] The game allows players in different release regions to work together; the game will use a pre-determined set of common greetings and commands that are translated to the various languages so that players can effectively communicate with each other.[2] However, players are limited to cooperating with those on the same platform, and will not feature cross-platform play.[3] Players also need to register with their console's service (PlayStation Network or Xbox Live) to use multiplayer features.[11] With an aim to reach a wider audience than past games, Monster Hunter: World also provides more information to players, such as a companion that will warn the player when they are running low on health, and more details on the advantages and disadvantages of weapons and armors against specific monsters.[4] In addition to quests shipped with the game, Capcom has offered downloadable content quests, similarly featured in the handheld versions. However, with the greater degree of connectivity offered by modern consoles/computers compared to handheld systems, Capcom has been able to offer several time-limited Event quests that players can easily jump in on through the new matchmaking system.[7][11][12] Through the event system, the game has included limited-time unique gameplay modes, such as a 16-person raid against a single monster, with players working in teams of four to help defeat the monster.[13] Capcom has also added new monsters to hunt through free downloadable content; the first such update, adding in the Deviljho monster from previous games was released alongside other quality-of-life updates in March 2018.[14][15][16] Capcom also expected to provide paid post-content material as well;[10] however, Capcom does not see World as a type of service, as they do not expect players to continue playing the game five to ten years after release.[17] The game will not include any type of microtransactions that influence gameplay; Tsujimoto said that as Monster Hunter is meant as a cooperative game, they did not want to create any type of 'friction' between players due to some having simply purchased better equipment with real-world funds compared to those that spent the time to work through challenges to acquire the equipment.[18] There is paid downloadable content available for the game, but these are limited to cosmetic items only, such as gestures, character customization options, and stickers used in communicating with other players."
                },
                {
                    "name": "Assassin's Creed Odyssey",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/ACOdysseyCoverArt.png/220px-ACOdysseyCoverArt.png",
                    "producer" : "Marc-Alexis Côté",
                    "developer" : "Ubisoft Quebec[a]",
                    "director" : "Jonathan Dumont Scott Phillips",
                    "publisher" : "Ubisoft",
                    "gamePlay" : "Assassin's Creed Odyssey places more emphasis on role-playing elements than previous games in the series. The game contains dialogue options, branching quests and multiple endings.[2] The player is able to choose between siblings Alexios and Kassandra as to whom they use as the main character.[3] The game features a notoriety system in which mercenaries chase after the player if they commit crimes like killing or stealing in the presence of others.[4] The player character is a Greek mercenary, and a descendant of the Spartan king Leonidas I. They inherit his broken spear, which is forged into a blade to become a weapon that grants the player special abilities in combat. The game uses a skill tree system that allows the player to unlock new abilities.[5] The three skill trees are 'hunter', which focuses on ranged attacks through the use of a bow & arrow, 'warrior', which focuses on weapons-based combat (swords, spears, axes etc.), and 'assassin', which focuses on stealth & silent take-downs. This replaces the system used in Origins, which granted the player a series of passive abilities. The hitbox combat system introduced in Origins returns and is expanded upon to grant the player access to different special skills when the ability bar fills up. These skills include calling a rain of arrows and a powerful kick to knock opponents off-balance,[4] and are similar to the 'Overpower' mechanic introduced in Origins that let the player use a powerful finishing move in combat. The game also features a gear system in which each piece of armor the player wears has different statistics and provides a range of advantages.[6] These can be equipped and upgraded individually. Assassin's Creed Odyssey also features naval combat again, with the player having access to Hellenistic-era warships to explore the Aegean Sea. The conflict between Athens and Sparta is represented through a 'War System' which enables players to take contracts from mercenaries and participate in different large-scale battles against hostile factions. The war system can change a faction's influence over a region.[6] The player can develop romantic relationships with non-playable characters of both genders, regardless of their own character's gender.[7][8] Creative director Jonathan Dumont commented that 'since the story is choice-driven, we never force players in romantic situations they might not be comfortable with (...) I think this allows everybody to build the relationships they want, which I feel respects everybody’s roleplay style and desires.' Players and critics appreciated this inclusion of queer romance options. However, many reacted negatively to a plot development in the Legacy of the First Blade DLC in which the player character has no choice but to enter into a relationship and have a child with a person of the opposite gender, considering that this invalidated their character's identity and the roleplaying aspects previously emphasized by Ubisoft.[9][10] Ubisoft responded that 'we strive to give players choice whenever possible in Odyssey and apologize to those surprised by the events in this episode'.[11][12] Ubisoft later stated that the forced romance would be removed with a future patch along with a modified cutscene.[13] However, this consisted of editing the cutscene slightly so that the player could tell their child they were only doing it for the blood-line - the child is still compulsory."
                },
                {
                    "name": "Hitman 2 (2018 video game)",
                    "img": "https://upload.wikimedia.org/wikipedia/en/thumb/8/88/Hitman_2_%282018%29_cover.jpg/220px-Hitman_2_%282018%29_cover.jpg",
                    "producer" : "Forest Swartout Large, Rasmus Nautrup Jensen, Karim Boussoufa, Kalvin Lyle, Jean Biam Tan",
                    "developer" : "IO Interactive",
                    "director" : "Christian Elverdam, Jacob Mikkelsen",
                    "publisher" : "Warner Bros. Interactive Entertainment",
                    "gamePlay" : "Hitman 2's gameplay is similar to that of the previous installment, being an action-adventure stealth-based game, as players control Agent 47, a contract assassin working for the International Contract Agency (ICA), in a third-person perspective, as he travels to various locations around the globe to eliminate high-profile criminal targets. The game features eight missions, which are set in distinct locations.[1][2] Summarily, the missions of the game take place (in order) on Hawke's Bay in New Zealand; at a racetrack in Miami; the fictional area of Santa Fortuna in Colombia; the slums of Mumbai; a fictional Vermont suburb; the fictional Isle of Sgàil somewhere in the North Atlantic; the fictional Milton-Fitzpatrick bank in New York City; and the fictional Haven Island resort in the Maldives. The game introduces concussive gadgets, which can be used to render an NPC unconscious, and reintroduces the briefcase, which allows the player to conceal and carry large weapons, such as sniper rifles, in public without arousing suspicion.[3] The game's announcement was accompanied by the release of a cooperative multiplayer mode titled Sniper Assassin, available immediately to those who pre-order Hitman 2. This mode is also bundled with all copies of Hitman 2 when the game releases.[4] In this mode, players are tasked with eliminating targets using a sniper rifle within a set time limit. In addition to Agent 47, players can play as Knight and Stone, both of whom have access to unique ammo types.[5] As with the game's predecessor, Hitman 2 features the time-limited 'Elusive Targets' missions. British actor Sean Bean portrays the first Elusive Target in the game."
                }
            ],
            "New" : [

            ]
        },
        "BgImg" : "https://images.unsplash.com/photo-1492684223066-81342ee5ff30?ixlib=rb-1.2.1&auto=format&fit=crop&w=428&h=214&q=60"
    }
}